In [1]:
import pandas as pd
import numpy as np

In [2]:
arr = np.random.randint(40, 99, 24).reshape(6,4)
arr

array([[84, 72, 72, 58],
       [67, 58, 88, 64],
       [61, 45, 70, 60],
       [61, 67, 73, 49],
       [93, 69, 78, 93],
       [68, 84, 42, 98]])

In [3]:
# Creating Dataframe
df = pd.DataFrame(arr, columns=["Math", "English", "Physics", "Sport"])

# Adding Column
df["Std_Name"] = ["Sachin", "Rohit", "Shubhaman", "Virat", "Ravindra","Rinku"] 

# Changing Column Position
cols = ["Std_Name", "Math", "English", "Physics", "Sport"]
df = df[cols]
df.head(3)

    Std_Name  Math  English  Physics  Sport
0     Sachin    84       72       72     58
1      Rohit    67       58       88     64
2  Shubhaman    61       45       70     60

In [4]:
df1 = df[["Std_Name", "Math", "English"]]
df2 = df[["Std_Name", "Physics", "Sport"]]

In [5]:
df1.head(2), df2.head(2)

(  Std_Name  Math  English
 0   Sachin    84       72
 1    Rohit    67       58,
   Std_Name  Physics  Sport
 0   Sachin       72     58
 1    Rohit       88     64)

In [6]:
type((df1.head(2), df2.head(2)))

tuple

In [17]:
df1.join(df2, lsuffix= '_',
    rsuffix= '_')

   Std_Name_  Math  English  Std_Name_  Physics  Sport
0     Sachin    84       72     Sachin       72     58
1      Rohit    67       58      Rohit       88     64
2  Shubhaman    61       45  Shubhaman       70     60
3      Virat    61       67      Virat       73     49
4   Ravindra    93       69   Ravindra       78     93
5      Rinku    68       84      Rinku       42     98

In [ ]:
df1.merge(df2, on="Std_Name", how="outer")

In [ ]:
df1 = df1[df1["Std_Name"]!="Sachin"]

In [ ]:
df1

In [ ]:
df2 = df2[df2["Std_Name"]!="Rinku"]
df2

In [ ]:
df1.merge(df2, on="Std_Name", how="left")

In [ ]:
df1

In [ ]:
df2

In [ ]:
df1.merge(df2, on="Std_Name", how="right")

In [ ]:
df1.merge(df2, how="cross", right_index=False)

# need to review

In [ ]:
dict = {
    "Name":["Raju", "Shyam", "Babu", "Raju", "Shyam", "Babu", "Raju", "Babu"],
    "Month":["Jan", "Jan", "Jan", "Feb", "Feb", "Feb", "Mar", "Mar"],
    "Sales": [2300, 2100, 3100, 2400, 3200, 2000, 2400, 2500]
}

In [ ]:
sales = pd.DataFrame(dict)
sales

In [ ]:
pd.pivot(sales, columns="Month", index="Name", values="Sales")

In [ ]:
dict = {
    "Name":["Raju", "Shyam", "Babu", "Raju", "Shyam", "Babu", "Raju", "Babu", "Raju", "Shyam", "Babu", "Raju"],
    "Month":["Jan", "Jan", "Jan", "Feb", "Feb", "Feb", "Mar", "Mar", "Jan", "Jan", "Jan", "Feb"],
    "Sales": [2300, 2100, 3100, 2400, 3200, 2000, 2400, 2500, 3100, 2400, 3200, 2000]
}

In [ ]:
new_sales = pd.DataFrame(dict)

In [ ]:
new_sales

In [ ]:
pd.pivot_table(new_sales, columns="Month", index="Name", values="Sales", aggfunc="sum")